app/views/houses/show.html.erb

              data: { confirm: 'Are you sure?' } %></p>
<% @house.characters.each do |person| %>
---
SELECT "characters".* FROM "characters" WHERE "characters"."house_id" = $1  [["house_id", 7]]