app/controllers/houses_controller.rb

  def create
    @house = House.create!(house_params)
---
INSERT INTO "houses" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "twretiou"], ["created_at", 2016-11-07 19:51:33 UTC], ["updated_at", 2016-11-07 19:51:33 UTC]]

  def update
    @house = House.find(params[:id])
    @house.update(house_params)
---
UPDATE "houses" SET "name" = $1, "updated_at" = $2 WHERE "houses"."id" = $3  [["name", "asdfasdf"], ["updated_at", 2016-11-07 18:49:50 UTC], ["id", 7]]

  def destroy
    @house = House.find(params[:id])
    @house.destroy
---
DELETE FROM "houses" WHERE "houses"."id" = $1  [["id", 9]]